
RUIDefaultDeviceName							= "TV";

OK												= "OK";
Next											= "Next";
Cancel											= "Cancel";

ResumeMenuResumeItem							= "Resume Playing";
ResumeMenuStartFromBeginningItem				= "Start from Beginning";

ITSPresentsMenuItem								= "iTunes Top 10";
ITunesTop10MusicVideos							= "iTunes Top 10 Music Videos";
LoadingDataFromITMS								= "Contacting the iTunes Store…";
LoadingDataFromApple							= "Loading Theatrical Trailers…";

PhotoModuleAllSubAlbumsMenuItem					= "All";
PhotoModuleSharedAlbumsMenuItem					= "Shared Photos";
PhotoModuleFetchingServersMenuItem				= "Locating Shared Photos…";
PhotoModuleNoServersMenuItem					= "No Shared Photos Available";
PhotoModuleNoServersExplanation					= "There are no shared iPhoto libraries currently available.";
PhotoWindowHeader								= "Photos";
NoPhotosInAlbumMessage							= "There are no photos in this album.";
PhotoSlideshowSettings							= "Slideshow Settings";

// Slideshow Settings:

PhotoSlideshowSettingTimePerSlide				= "Time Per Slide";
PhotoSlideshowSettingMusic						= "Music";
PhotoSlideshowSettingRepeat						= "Repeat";
PhotoSlideshowSettingShufflePhotos				= "Shuffle Photos";
PhotoSlideshowSettingShuffleMusic				= "Shuffle Music";
PhotoSlideshowSettingKenBurns					= "Ken Burns Effect";
PhotoSlideshowSettingTransitions				= "Transitions";
PhotoSlideshowSettingTimeFormat					= "%d seconds"; // examples: 3 seconds, 5 seconds, 10 seconds

PhotoSettingRandomTransitions					= "Random";
PhotoSettingNoTransitions						= "Off";
Cube											= "Cube";
Dissolve										= "Dissolve";
Droplet											= "Droplet";
"Fade Through Black"							= "Fade Through Black";
Flip											= "Flip";
"Mosaic Flip Large"								= "Mosaic Flip Large";
"Mosaic Flip Small"								= "Mosaic Flip Small";
"Page Flip"										= "Page Flip";
Push											= "Push";
Reveal											= "Reveal";
Twirl											= "Twirl";
Wipe											= "Wipe";

PhotoSlideshowSettingMusicNowPlaying			= "Now Playing";

PhotoSettingOff									= "Off";
PhotoSettingOn									= "On";

TVShowsHourMinuteSecondFormat					= "%d:%02d:%02d";
TVShowsMinuteSecondFormat						= "%d:%02d";
TVShowsUnknownShow								= "Untitled";
SortWidgetDateLabel								= "Date";
SortWidgetShowLabel								= "Show";

/* Metadata strings */
ActorsSeparator									= ", ";

MetadataLabelSeparator							= ":";

MetadataCast									= "Actors";
MetadataDuration								= "Length";
MetadataAirDate									= "Aired";
MetadataReleaseDate								= "Released";
MetadataInTheatres								= "In Theatres";
MetadataArtist									= "Artist";
MetadataAlbum									= "Album";
MetadataGenre									= "Genre";
MetadataNumberOfEpisodes						= "Number of Episodes";
MetadataNumberOfTracks							= "Tracks";
MetadataMostRecent								= "Most Recent";
MetadataDirector								= "Director";
MetadataDirectors								= "Directors";
MetadataProducer								= "Producer";
MetadataProducers								= "Producers";
MetadataArtistVarious							= "Various";
MetadataArtistUnknown							= "Unknown Artist";
MetadataAlbumUnknown							= "Unknown Album";
MetadataPlaylistUnknown							= "Unknown Playlist";
MetadataComposerUnknown							= "Unknown Composer";
MetadataGenreUnknown							= "Unknown Genre";
MetadataAuthor									= "Author";
MetadataTitle									= "Title";
MetadataEpisode									= "Episode";
MetadataSeasonFormat							= "(Season %d)";
MetadataFrom									= "From";
MetadataTags									= "Tags";
MetadataViews									= "Views";
MetadataDateAdded								= "Added";
MetadataCategory								= "Category";

/* Rating strings */
RatingExplicit									= "Explicit";

MediaTitleDefault								= "Untitled";

StreamingNameInList								= "Streaming";
StreamingSearchingForSharedMedia				= "Searching for shared content…";

TodayDate										= "Today";
YesterdayDate									= "Yesterday";

GoBackText										= "Press Menu to go back";

/* key is always the same, value is language key like ru, Spanish, etc */
UseMe											= "English";

AuthPasswordPrompt								= "Password:";
AuthEnterPasswordPrompt							= "Enter password for %@:";

TextInputDoneLabel								= "DONE";
TextInputDeleteLabel							= "DELETE";
TextInputSpaceLabel								= "SPACE";

AlternateTextInputSpaceLabel					= "Space";
AlternateTextInputDeleteLabel					= "Delete";
TextInputMoreSymbolsLabel						= "#+=";
TextInputMoreCharactersLabel					= "abc";

/* all the items in this group are old and will be replaced with non-Module versions */

MusicNameInList									= "Music";
MusicPlaylistsMenuItem							= "Playlists";
MusicArtistsMenuItem							= "Artists";
MusicAlbumsMenuItem								= "Albums";
MusicSongsMenuItem								= "Songs";
MusicPodcastsMenuItem							= "Podcasts";
MusicMusicVideosMenuItem						= "Music Videos";
MusicGenresMenuItem								= "Genres";
MusicComposersMenuItem							= "Composers";
MusicAudiobooksMenuItem							= "Audiobooks";
MusicShuffleSongsMenuItem						= "Shuffle Songs";
MusiciTunesPresentsMenuItem						= "iTunes Store Presents";
MusicNowPlayingMenuItem							= "Now Playing";
MusicCDMenuItem									= "%@";
MusicCDEjectMenuItem							= "Eject CD";
MusicSharedMusicMenuItem						= "Shared Music";
MusicSpecialPlaylistName						= "Front Row Playlist";
MusicAllAlbumsListHeader						= "All Albums";
MusicAllSongsListHeader							= "All Songs";
MusicAllArtistsListHeader						= "All Artists";
MusicAllTracksListSpecifier						= "All";
MusicUntitledTrack								= "Untitled Track";
MusicNoSharedPlaylistsMenuItem					= "No Music Available";
MusicTrackIndexOfCount							= "%ld of %ld";

/* radio-specific music strings*/
MusicRadioBufferingText							= "Buffering stream “%@”";

TrailerNegativeTimeChar							= "-";
TrailerHourMinuteSecondFormat					= "%@%01d:%02d:%02d";
TrailerMinuteSecondFormat						= "%@%01d:%02d";

GenericError                                    = "An error occurred.";
GenericListError								= "There are no items in this list.";

WaitPleaseWait									= "Please wait";
WaitContactingRemoteHost						= "Contacting remote iTunes host…";

WirelessSetupSearchText							= "Searching for wireless networks…";
NotConnectedToInternet							= "Your Apple TV is not connected to the internet.";
NotConnectedToNetwork							= "Your Apple TV is not connected to the network.";
CheckNetworkConnection							= "Check your network settings and try again.";
UntitledWirelessNetworkName						= "N/A";

// iTunesPairing Strings
PairWithITunesTitle								= "Connect to iTunes";

PairWithITunesForInitialSyncingDescription		= "To finish setup and sync your iTunes content to your Apple TV, open iTunes and select Apple TV from the Devices list. You will need to enter this passcode:";
PairWithITuneForInitialSyncingSkipPairingLabel	= "To use Apple TV for streaming only, press Menu and choose “Connect to iTunes” from the Sources menu.";

PairWithITunesForSyncingDescription				= "To connect to iTunes and sync your content to your Apple TV, open iTunes and select Apple TV from the Devices list. You will need to enter this passcode:";
PairWithITunesForSyncingDescriptionWhenCurrentlyPaired	= "Your Apple TV is currently connected to “%@”. To connect to a different library, open iTunes on that computer and select Apple TV from the Devices list. This will replace all content on your Apple TV. You will need to enter this passcode:";

PairWithITunesForSyncingSkipPairingLabel		= "";

PairWithITunesForStreamingDescription			= "To stream iTunes content to your Apple TV, open iTunes and select Apple TV from the Devices list. You will need to enter this passcode:";
PairWithITunesStreamingSkipPairingLabel			= "";

PairWithITunesTurningOffSyncingWarning			= "Turning off syncing will delete any content that is currently on your Apple TV.";
PairWithITunesChangingSyncingHostWarning		= "Changing the iTunes library will replace all content on your Apple TV.";

PairWithITunesRequirementLabel					= "Apple TV requires iTunes 7.1.1 or later";
PairWithITunesCancel							= "Cancel";
PairWithITunesContinue							= "Continue";


// These are the strings for a fatal error alert.  The user will basically have the option to cancel or restart the app
FatalExceptionAlertTitle						= "An error occurred.";
FatalExceptionAlertDescription					= "Press Play/Pause to restart your Apple TV.";

// These are UI strings for various timings
720p60											= "720p HD";
720p50											= "720p HD - 50Hz";
1080i60											= "1080i HD";
1080i50											= "1080i HD - 50Hz";
1080p60											= "1080p HD";
1080p50											= "1080p HD - 50Hz";
480p60											= "480p";
576p50											= "576p - 50Hz ";
576i											= "576i - 50Hz";

// Loading data from remote sources
LoadingLibrary									= "Connecting";
LoadingLibraryNamed								= "Loading “%@”…";
ConnectionToiTunesLost							= "iTunes Library Unavailable";
WaitingForiTunesToStart							= "Attempting to reconnect to \"%@\". Make sure the computer is on and iTunes is open.";
GoToSources										= "Go To Sources";
AttemptingToAuthorizeContent					= "Attempting to authorize…";

SharedITunesLibraryPasswordTitle				= "Shared Library Password";
SharedITunesLibraryPasswordText					= "Enter the password for “%@” and then click Done.";
SharedITunesLibraryPasswordPrompt				= "Password:";
SharedITunesLibraryPasswordRetryTitle			= "Password Incorrect";
SharedITunesLibraryPasswordRetryText			= "The password you entered for “%@” is incorrect.\nTry again.";

SharedIPhotoLibraryPasswordTitle				= "Photo Library Password";
SharedIPhotoLibraryPasswordText					= "Enter the password for “%@” and then click Done.";
SharedIPhotoLibraryPasswordPrompt				= "Password:";
SharedIPhotoLibraryPasswordRetryTitle			= "Password Incorrect";
SharedIPhotoLibraryPasswordRetryText			= "The password you entered for “%@” is incorrect.\nTry again.";

ConnectToITunesForStreaming						= "Connect to New iTunes";
StreamingServerNotAvailable						= "Library Unavailable";
TurnOnStreamingServer							= "Make sure the computer with “%@” is on and iTunes is open.";
DisconnectStreamingHost							= "Disconnect from iTunes";
MaxStreamingHostCountReached					= "You can only connect to up to five iTunes libraries. Choose a library to disconnect so that you can connect to a new library.";
SelectHostToDelete								= "Connect to New iTunes.";

// Messages shown above sync progress indicator during syncing:
BRSyncProgressSourceTextFormat					= "Syncing “%@”"; // %@ is name of iTunes library
BRSyncProgressAssetTextFormat					= "Copying %d of %d: %@"; // Example: Copying 123 of 295: Finding Nemo

// Parental Controls passcode text
BRParentalControlsPasscodeEnterTitle			= "Enter Passcode";
BRParentalControlsPasscodeEnterPrompt			= "Enter your four-digit parental controls passcode.";
BRParentalControlsPasscodeWrongTitle			= "Passcode Incorrect";
BRParentalControlsPasscodeWrongPrompt			= "The passcode you entered is incorrect.";
BRParentalControlsPasscodeSetTitle				= "Set Passcode";
BRParentalControlsPasscodeSetPrompt				= "To set parental controls for your Apple TV for the first time, enter a four-digit passcode. After your passcode is set, you'll need to enter it to make changes to parental controls in the future.";
BRParentalControlsPasscodeConfirmTitle			= "Confirm Passcode";
BRParentalControlsPasscodeConfirmPrompt			= "Reenter your four-digit passcode.";
BRParentalControlsPasscodeConfirmedTitle		= "Passcode Confirmed";
BRParentalControlsPasscodeConfirmedPrompt		= "Make sure you keep your passcode in a safe place. If you forget your passcode, reset it by choosing Factory Restore to restore your Apple TV to original factory condition.";
BRParentalControlsPasscodeMismatchTitle			= "Passcode Does Not Match";
BRParentalControlsPasscodeMismatchPrompt		= "The passcode you entered does not match.";
BRParentalControlsPasscodeTryAgainItem			= "Set Passcode Again";
BRParentalControlsPasscodeOldTitle				= "Old Passcode";
BRParentalControlsPasscodeOldPrompt				= "Enter your old four-digit passcode.";
BRParentalControlsPasscodeChangeTitle			= "New Passcode";
BRParentalControlsPasscodeChangePrompt			= "Enter your new four-digit passcode.";

// Syncing text
BRSettingSyncing								= "Syncing";
BRSettingTurnOnSyncing							= "Turn On Syncing";
BRSettingTurnOffSyncing 						= "Turn Off Syncing";
BRSettingChangeITunesLibrary 					= "Change iTunes Library";

// Combo Row text
AssetViewFormat									= "%@ view";
AssetViewsFormat								= "%@ views";

BRDVDLoadingText								= "Loading DVD…";
BRDVDMenuItemResume								= "Resume Playing";
BRDVDMenuStartFromBeginning						= "Start from Beginning";
BRDVDMenuItemEjectDisk							= "Eject Disc";
BRDVDMenuItemDVDMenu							= "DVD Menu";
BRDVDPlayerChapterFormatter                     = "Chapter %d of %d";

// Account Management text
BRAccountSelectorOtherAccount					= "Other…";

// HDCP Error dialog
HDCPErrorDialogTitle							= "No HDCP";
HDCPErrorDialogExplanation						= "This content requires HDCP for playback. To watch this content, make sure the connected displays support HDCP.";


